rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
# STM32 Boards

menu.cpu=Processor
menu.cpu_upload_menu=CPU & Upload mode

menu.upload_method=Upload method

##############################################################
maple_mini.name=LeafLabs Maple Mini Rev 2 to Flash

maple_mini.upload.tool=maple_upload
maple_mini.upload.protocol=maple_dfu
maple_mini.upload.maximum_size=108000
maple_mini.upload.use_1200bps_touch=false
maple_mini.upload.file_type=bin
maple_mini.upload.ram.maximum_size=17000
maple_mini.upload.flash.maximum_size=108000

maple_mini.upload.usbID=1EAF:0003
maple_mini.upload.altID=1
maple_mini.upload.auto_reset=true

maple_mini.build.mcu=cortex-m3
maple_mini.build.f_cpu=72000000L
maple_mini.build.board=MAPLE_MINI
maple_mini.build.core=maple
maple_mini.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
maple_mini.build.ldscript=ld/flash.ld
maple_mini.build.variant=maple_mini
maple_mini.build.variant_system_lib=libmaple.a
maple_mini.build.vect=VECT_TAB_FLASH
maple_mini.build.density=STM32_MEDIUM_DENSITY
maple_mini.build.error_led_port=GPIOB
maple_mini.build.error_led_pin=1
maple_mini.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
#maple_miniRAM.name=LeafLabs Maple Mini Rev 2 to RAM
#
#maple_miniRAM.upload.tool=maple_upload
#maple_miniRAM.upload.protocol=maple_dfu
#maple_miniRAM.upload.maximum_size=17000
#maple_miniRAM.upload.use_1200bps_touch=false
#maple_miniRAM.upload.file_type=bin
#maple_miniRAM.upload.ram.maximum_size=17000
#maple_miniRAM.upload.flash.maximum_size=108000
#maple_miniRAM.upload.usbID=1EAF:0003
#maple_miniRAM.upload.altID=0
#maple_miniRAM.upload.auto_reset=true
#
#maple_miniRAM.build.mcu=cortex-m3
#maple_miniRAM.build.f_cpu=72000000L
#maple_miniRAM.build.board=MAPLE_MINI_RAM
#maple_miniRAM.build.core=maple
#maple_miniRAM.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
#maple_miniRAM.build.ldscript=ld/ram.ld
#maple_miniRAM.build.variant=maple_mini
#maple_miniRAM.build.variant_system_lib=libmaple.a
#maple_miniRAM.build.vect=VECT_TAB_RAM
#maple_miniRAM.build.density=STM32_MEDIUM_DENSITY
#maple_miniRAM.build.error_led_port=GPIOB
#maple_miniRAM.build.error_led_pin=1
#maple_miniRAM.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1



##############################################################
maple.name=LeafLabs Maple Rev 3+ to Flash

maple.upload.tool=maple_upload
maple.upload.protocol=maple_dfu
maple.upload.maximum_size=108000
maple.upload.use_1200bps_touch=false
maple.upload.file_type=bin
maple.upload.ram.maximum_size=17000
maple.upload.flash.maximum_size=108000
maple.upload.usbID=1EAF:0003
maple.upload.altID=1
maple.upload.auto_reset=true

maple.build.mcu=cortex-m3
maple.build.f_cpu=72000000L
maple.build.board=MAPLE_REV3
maple.build.core=maple
maple.build.extra_flags=-DMCU_STM32F103RB -mthumb  -DBOOTLOADER_maple -march=armv7-m  -D__STM32F1__  
maple.build.ldscript=ld/flash.ld
maple.build.variant=maple
maple.build.variant_system_lib=libmaple.a
maple.build.vect=VECT_TAB_FLASH
maple.build.density=STM32_MEDIUM_DENSITY
maple.build.error_led_port=GPIOA
maple.build.error_led_pin=5
maple.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


##############################################################
genericSTM32.name=STM32 to Flash - No bootloader

genericSTM32.menu.upload_method.serialMethod=Serial
genericSTM32.menu.upload_method.serialMethod.upload.protocol=maple_serial
genericSTM32.menu.upload_method.serialMethod.upload.tool=serial_upload
genericSTM32.menu.upload_method.STLinkMethod=STLink
genericSTM32.menu.upload_method.STLinkMethod.upload.protocol=STLink
genericSTM32.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

genericSTM32.upload.maximum_size=108000
genericSTM32.upload.use_1200bps_touch=false
genericSTM32.upload.file_type=bin
genericSTM32.upload.ram.maximum_size=17000
genericSTM32.upload.flash.maximum_size=108000

genericSTM32.upload.usbID=1EAF:0003
genericSTM32.upload.altID=1
genericSTM32.upload.auto_reset=true

genericSTM32.build.mcu=cortex-m3
genericSTM32.build.f_cpu=72000000L
genericSTM32.build.board=GENERIC_STM32
genericSTM32.build.core=maple
genericSTM32.build.extra_flags=-DMCU_STM32F103CB -mthumb   -march=armv7-m  -D__STM32F1__ 
genericSTM32.build.ldscript=ld/jtag.ld
genericSTM32.build.variant=maple_mini
genericSTM32.build.variant_system_lib=libmaple.a
genericSTM32.build.vect=VECT_TAB_FLASH
genericSTM32.build.density=STM32_MEDIUM_DENSITY
genericSTM32.build.error_led_port=GPIOB
genericSTM32.build.error_led_pin=1
genericSTM32.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


##############################################################
genericSTM32F103R.name=Generic STM32F103RE
genericSTM32F103R.upload.maximum_size=492000
genericSTM32F103R.upload.ram.maximum_size=61000
genericSTM32F103R.upload.flash.maximum_size=492000
genericSTM32F103R.build.error_led_port=GPIOA
genericSTM32F103R.build.error_led_pin=5
genericSTM32F103R.build.variant=generic_stm32f103rxx
genericSTM32F103R.build.extra_flags=-DMCU_STM32F103RE -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103R.build.ldscript=ld/jtag.ld

genericSTM32F103R.upload.tool=serial_upload
genericSTM32F103R.upload.protocol=maple_dfu
genericSTM32F103R.upload.use_1200bps_touch=false
genericSTM32F103R.upload.file_type=bin
#genericSTM32F103R.upload.usbID=1EAF:0003
#genericSTM32F103R.upload.altID=1
#genericSTM32F103R.upload.auto_reset=true
genericSTM32F103R.build.mcu=cortex-m3
genericSTM32F103R.build.f_cpu=72000000L
genericSTM32F103R.build.board=GENERIC_STM32F103R
genericSTM32F103R.build.core=maple
genericSTM32F103R.build.vect=VECT_TAB_FLASH

##############################################################

microduino32_flash.name=Microduino Core STM32 to Flash

microduino32_flash.upload.tool=maple_upload
microduino32_flash.upload.protocol=maple_dfu
microduino32_flash.upload.maximum_size=108000
microduino32_flash.upload.use_1200bps_touch=false
microduino32_flash.upload.file_type=bin
microduino32_flash.upload.ram.maximum_size=17000
microduino32_flash.upload.flash.maximum_size=108000
microduino32_flash.upload.usbID=1EAF:0003
microduino32_flash.upload.altID=1
microduino32_flash.upload.auto_reset=true


microduino32_flash.build.mcu=cortex-m3
microduino32_flash.build.f_cpu=72000000L
microduino32_flash.build.board=MICRODUINO_CORE_STM32
microduino32_flash.build.core=maple
microduino32_flash.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
microduino32_flash.build.ldscript=ld/flash.ld
microduino32_flash.build.variant=microduino
microduino32_flash.build.variant_system_lib=libmaple.a
microduino32_flash.build.vect=VECT_TAB_FLASH
microduino32_flash.build.density=STM32_MEDIUM_DENSITY
# FIXME!
microduino32_flash.build.error_led_port=GPIOB
microduino32_flash.build.error_led_pin=1
microduino32_flash.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
nucleo_f103rb.name=STM Nucleo F103RB (STLink)

nucleo_f103rb.upload.tool=stlink_upload
nucleo_f103rb.upload.protocol=maple_dfu
nucleo_f103rb.upload.maximum_size=108000
nucleo_f103rb.upload.use_1200bps_touch=false
nucleo_f103rb.upload.file_type=bin
nucleo_f103rb.upload.ram.maximum_size=17000
nucleo_f103rb.upload.flash.maximum_size=108000
nucleo_f103rb.upload.params.quiet=no

nucleo_f103rb.upload.usbID=1EAF:0003
nucleo_f103rb.upload.altID=1
nucleo_f103rb.upload.auto_reset=true

nucleo_f103rb.build.mcu=cortex-m3
nucleo_f103rb.build.f_cpu=72000000L
nucleo_f103rb.build.board=STM_NUCLEU_F103RB
nucleo_f103rb.build.core=maple
nucleo_f103rb.build.extra_flags=-DMCU_STM32F103RB -mthumb    -march=armv7-m  -D__STM32F1__ 
nucleo_f103rb.build.ldscript=ld/jtag.ld
nucleo_f103rb.build.variant=nucleo_f103rb
nucleo_f103rb.build.variant_system_lib=libmaple.a
nucleo_f103rb.build.vect=VECT_TAB_FLASH
nucleo_f103rb.build.density=STM32_MEDIUM_DENSITY
nucleo_f103rb.build.error_led_port=GPIOB
nucleo_f103rb.build.error_led_pin=1
nucleo_f103rb.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1






##############################################################
#mapleRAM.name=LeafLabs Maple Rev 3+ to RAM

#mapleRAM.upload.tool=maple_upload
#mapleRAM.upload.protocol=maple_dfu
#mapleRAM.upload.maximum_size=17000
#mapleRAM.upload.use_1200bps_touch=false
#mapleRAM.upload.file_type=bin
#mapleRAM.upload.ram.maximum_size=17000
#mapleRAM.upload.flash.maximum_size=108000
#mapleRAM.upload.usbID=1EAF:0003
#mapleRAM.upload.altID=0
#mapleRAM.upload.auto_reset=true
#
#mapleRAM.build.mcu=cortex-m3
#mapleRAM.build.f_cpu=72000000L
#mapleRAM.build.board=MAPLE_REV3_TO_RAM
#mapleRAM.build.core=maple
#mapleRAM.build.extra_flags=-DMCU_STM32F103RB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
#mapleRAM.build.ldscript=ld/ram.ld
#mapleRAM.build.variant=maple
#mapleRAM.build.variant_system_lib=libmaple.a
#mapleRAM.build.vect=VECT_TAB_RAM
#mapleRAM.build.density=STM32_MEDIUM_DENSITY
#mapleRAM.build.error_led_port=GPIOA
#mapleRAM.build.error_led_pin=5
#mapleRAM.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


#####################################################################

GenericSTM32F103C.name= Generic STM32F103C
GenericSTM32F103C.upload.tool=upload_router
#GenericSTM32F103C.upload.tool=maple_upload
GenericSTM32F103C.build.core=maple
GenericSTM32F103C.build.variant=generic_stm32f103c
GenericSTM32F103C.upload.use_1200bps_touch=false
GenericSTM32F103C.upload.file_type=bin
GenericSTM32F103C.upload.usbID=1EAF:0003
GenericSTM32F103C.upload.auto_reset=true
GenericSTM32F103C.build.mcu=cortex-m3
GenericSTM32F103C.build.f_cpu=72000000L
GenericSTM32F103C.build.board=GENERIC_STM32F103C
GenericSTM32F103C.build.common_flags=-mthumb  -march=armv7-m -D__STM32F1__ 
GenericSTM32F103C.build.variant_system_lib=libmaple.a
GenericSTM32F103C.build.error_led_port=GPIOB
GenericSTM32F103C.build.error_led_pin=1

## ==UPLOAD MODE==
## F103CB USB to Flash upload
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash= F103CB(128k) USB->Flash
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.ldscript=ld/flash.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple 
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.flash.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.protocol=maple_dfu

## F103CB USB to RAM upload
## -------------------------
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM=F103CB(128k) USB->RAM
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.ldscript=ld/ram.ld
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple 
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.vect=VECT_TAB_RAM
#
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.ram.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.flash.maximum_size=108000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.altID=0
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.protocol=maple_dfu

## UPLOAD MODE
## F103CB Serial to Flash upload (keep bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash=F103CB(128k) Serial->Flash (keeps bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.ldscript=ld/flash.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.flash.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.protocol=maple_serial

## UPLOAD MODE
## F103CB Serial to Flash upload (overwrites bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG=F103CB(128k) Serial->Flash (overwrites bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.ldscript=ld/jtag.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.cpu_flags=-DMCU_STM32F103CB  
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.maximum_size=128000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.ram.maximum_size=20000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.flash.maximum_size=128000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.protocol=maple_serial


## ==UPLOAD MODE F103C8 ==
## F103C8 USB to Flash upload
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash=F103C8(64k) USB->Flash
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.ldscript=ld/flash_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.flash.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.protocol=maple_dfu

## F103C8 USB to RAM upload
## -------------------------
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM=F103C8(64k) USB->RAM
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.ldscript=ld/ram_c8.ld
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.vect=VECT_TAB_RAM
#
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.ram.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.flash.maximum_size=44000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.altID=0
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.protocol=maple_dfu

## F103C8 Serial to Flash upload (keep bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash=F103C8(64k) Serial->Flash (keeps bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.ldscript=ld/flash_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.flash.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.protocol=maple_serial

## F103C8 Serial to Flash upload (overwrites bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG=F103C8(64k) Serial->Flash (overwrites bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.ldscript=ld/jtag_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.cpu_flags=-DMCU_STM32F103C8
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.maximum_size=64000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.ram.maximum_size=20000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.flash.maximum_size=64000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.protocol=maple_serial

##############################################################
genericSTM32F103Z.name=Generic STM32F103Z
genericSTM32F103Z.upload.maximum_size=492000
genericSTM32F103Z.upload.ram.maximum_size=61000
genericSTM32F103Z.upload.flash.maximum_size=492000
genericSTM32F103Z.build.error_led_port=GPIOA
genericSTM32F103Z.build.error_led_pin=5
genericSTM32F103Z.build.variant=generic_stm32f103zxx
genericSTM32F103Z.build.extra_flags=-DMCU_STM32F103ZE -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103Z.build.ldscript=ld/jtag.ld

genericSTM32F103Z.upload.tool=serial_upload
genericSTM32F103Z.upload.protocol=maple_dfu
genericSTM32F103Z.upload.use_1200bps_touch=false
genericSTM32F103Z.upload.file_type=bin
#genericSTM32F103Z.upload.usbID=1EAF:0003
#genericSTM32F103Z.upload.altID=1
#genericSTM32F103Z.upload.auto_reset=true
genericSTM32F103Z.build.mcu=cortex-m3
genericSTM32F103Z.build.f_cpu=72000000L
genericSTM32F103Z.build.board=GENERIC_STM32F103Z
genericSTM32F103Z.build.core=maple
genericSTM32F103Z.build.vect=VECT_TAB_FLASH